{
  "activation_dropout": 0.0,
  "activation_function": "gelu",
  "architectures": [
    "BartForConditionalGeneration"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "classifier_dropout": 0.0,
  "d_model": 128,
  "decoder_attention_heads": 1,
  "decoder_ffn_dim": 1024,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 1,
  "decoder_start_token_id": 1,
  "dropout": 0.1,
  "encoder_attention_heads": 1,
  "encoder_ffn_dim": 1024,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 1,
  "eos_token_id": 2,
  "forced_eos_token_id": 2,
  "grapheme_chars": "____AIQWYabdfhijklmnpstuvwz'-.BCDEFGHJKLMNOPRSTUVXZcegoqrxy",
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1",
    "2": "LABEL_2"
  },
  "init_std": 0.02,
  "is_encoder_decoder": true,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_2": 2
  },
  "max_position_embeddings": 64,
  "model_type": "bart",
  "num_hidden_layers": 1,
  "pad_token_id": 0,
  "phoneme_chars": "____AIQWYabdfhijklmnpstuvwz\u00f0\u014b\u0251\u0252\u0254\u0259\u025b\u025c\u0261\u026a\u0279\u0283\u028a\u028c\u0292\u02a4\u02a7\u02c8\u02cc\u02d0\u03b8\u1d4a",
  "scale_embedding": false,
  "torch_dtype": "float32",
  "transformers_version": "4.51.2",
  "use_cache": true,
  "vocab_size": 63
}
